Revit 2026 API

# ExternalApplicationArrayIterator Class

---

An iterator to an array of IExternalApplication objects..

SystemObject Autodesk.Revit.DBAPIObject Autodesk.Revit.UIExternalApplicationArrayIterator

**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public abstract class ExternalApplicationArrayIterator : APIObject,
	IEnumerator
```
```vb
Public MustInherit Class ExternalApplicationArrayIterator
	Inherits APIObject
	Implements IEnumerator
```
```cpp
public ref class ExternalApplicationArrayIterator abstract : public APIObject,
	IEnumerator
```
```fsharp
[<AbstractClassAttribute>]
type ExternalApplicationArrayIterator =
    class
        inherit APIObject
        interface IEnumerator
    end
```

The ExternalApplicationArrayIterator type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | ExternalApplicationArrayIterator | For Internal Use Only. |

|  | Name | Description |
| --- | --- | --- |
|  | Current | Retrieves the item that is the current focus of the iterator. |
|  | IsReadOnly | Identifies if the object is read-only or modifiable.(Inherited from APIObject) |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Causes the object to release immediately any resources it may be utilizing.(Inherited from APIObject) |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | MoveNext | Move the iterator one item forward. |
|  | Reset | Bring the iterator back to the start of the array. |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

Autodesk.Revit.UI Namespace